# Напишите генераторную функцию вычисления числа Фибоначчи fibonacci, 
# на вход которой подается целочисленное значение n. 
# Функция не должна использовать рекурсию.

# Код генераторной функции


if __name__ == "__main__":
    n = 10
    for i in fibonacci(n):
        print(i)
