# Напишите генераторную функцию alphabet, 
# возвращающую по запросу буквы английского 
# алфавита (в строгой последовательности) в нижнем регистре.

# Код генераторной функции


if __name__ == "__main__":
    abc = alphabet()
    print(next(abc))
    print(next(abc))
    print(next(abc))
