# Напишите функцию is_anagram, на вход которой подается две строки. 
# Функция должна осуществлять проверку, являются ли переданные 
# значения анаграммами или нет, после чего вернуть 
# результат проверки (True – да, нет – False).
... # Ваш код


if __name__ == "__main__":
    my_str1 = input("Введите первую строку ")
    my_str2 = input("Введите вторую строку ")

    print(is_anagram(my_str1, my_str2))
