#Напишите функцию max_number, на вход которой подается 
# целочисленный список и возвращается его найденное 
# максимальное значение.
... # Ваш код


if __name__ == "__main__":
    my_list = list(map(int, input().strip().split()))
    print(max_number(my_list))