# Напишите функцию lmc, на вход которой подается два целочисленных значения. 
# Функция должна быть реализована без использования рекурсии и 
# возвращать их наименьшее общее кратное. 
... # Ваш код

if __name__ == "__main__":
    my_val1 = int(input("Введите первое значение "))
    my_val2 = int(input("Введите второе значение "))

    print(lmc(my_val1, my_val2))
