#Напишите функцию multiply, возвращающую произведение 
# элементов из поступающего на ее вход списка.
... # Ваш код



if __name__ == "__main__":
    my_list = list(map(int, input().strip().split()))
    print(multiply(my_list))
