# Напишите функцию month_days, на вход которой подается 
# целочисленное значение, представляющее собой номер месяца. 
# Функция должна возвращать количество дней в месяце. 
# Если введен не корректный номер месяца, то возвращается ноль.
... # Ваш код



if __name__ == "__main__":
    my_val1 = int(input("Введите искомое значение "))

    print(month_days(my_val1))
