# Напишите функцию max_count, на вход которой подается 
# целочисленный список и возвращается значение элемента, 
# который встречается наибольшее число раз.
... # Ваш код


if __name__ == "__main__":
    my_list = list(map(int, input().strip().split()))
    print(max_count(my_list))
