# Напишите функцию fahrenheit_to_celsius, которая осуществляет 
# перевод подаваемого значения (в градусах Фаренгейта) 
# на ее вход в градусы Цельсия и возвращает полученный результат.
... # Ваш код


if __name__ == "__main__":
    val1 = int(input("Введите температуру "))
    print(fahrenheit_to_celsius(val1))
