#Напишите функцию list_create, на вход которой подается 3 значения 
# любого типа и возвращающую сформированный из них список.
... # Ваш код


if __name__ == "__main__":
    my_list1 = [1, 2, 3, 4]
    my_int = 9
    my_str = "test"

    print(list_create(my_list1, my_int, my_str))
