# Напишите функцию pow3, возводящую в куб подаваемое 
# на вход значение и возвращающую полученный результат.
... # Ваш код

if __name__ == "__main__":
    my_var1 = int(input("Введите значение "))

    print(pow3(my_var1))
