# Напишите декоратор celsius, который будет переводить в градусы 
# Цельсия возвращаемое значение функцией temperature_fahrenheit, 
# на вход которой подается значение температуры в градусах Фаренгейта, 
# и оно же возвращается. 


# Код декоратора


@celsius
# Код функции


if __name__ == "__main__":
    print(temperature_fahrenheit(32)) # 0
