# На вход программы подается 2 значения: val1, val2. 
# Если они равны, то выведите в терминал «True», иначе «False» (без кавычек).
def app():
    num_1 = input()
    num_2 = input()
    print(num_1 == num_2)


if __name__ == "__main__":
    app()
