# Напишите рекурсивную функцию recursion_palindrom, на вход которой 
# подается строка. Если строка представляет собой палиндром, 
# то функция должна вернуть значение – True, иначе – False.  

# Ваш код


if __name__ == "__main__":
    my_strt = "11145111"
    print(recursion_palindrom(my_strt))
