# Напишите рекурсивную функцию вычисления факториала factorial, 
# на вход которой подается целочисленное значение n. 

# Ваш код    


if __name__ == "__main__":
    n = int(input("Введите значение n "))
    print(factorial(n))
