# Напишите рекурсивную функцию remove_v, 
# удаляющую из строки все заданные буквы и возвращающую 
# результирующую строку.

# Ваш код 


if __name__ == "__main__":
    my_str = "Приyyyyвет"
    print(remove_v(my_str, 'у'))
