# Напишите рекурсивную функцию вычисления числа Фибоначчи fibonacci, 
# на вход которой подается целочисленное значение n.

# Ваш код 


if __name__ == "__main__":
    n = int(input("Введите значение n "))
    print(fibonacci(n))
