# Напишите рекурсивную функцию negative_sum, которой на вход 
# подается список из целочисленных значений и возвращающую 
# сумму отрицательных элементов списка

# Ваш код 


if __name__ == "__main__":
    my_list = [-2, -4, -6, 5, 6, 7]
    print(negative_sum(my_list))
