# Напишите рекурсивную функцию remove_brackets, которой на вход 
# подается строка, содержащая одну пару из открывающейся и 
# закрывающейся скобки. Функция должна вернуть строку, состоящую 
# из символов, находящихся в скобках исходной строки.

# Ваш код 


if __name__ == "__main__":
    my_strt = "4(11145111)46"
    print(remove_brackets(my_strt))
