# Напишите рекурсивную функцию check_pow2, 
# принимающую на вход 2 аргумента (первый аргумент n, 
# второй аргумент check_value=1) и проверяющую то, 
# является ли введенное значение точной степенью двойки. 
# Если да – выведите в терминал «YES», иначе – «NO» (без кавычек).

# Ваш код 


if __name__ == "__main__":
    n = int(input())
    check_value = 4
    print(check_pow2(n, check_value))
