# Напишите рекурсивную функцию recursion_sum, на вход которой 
# подается целочисленное значение n. Необходимо вычислить 
# сумму всех чисел от 1 до n.

# Ваш код

if __name__ == "__main__":
    val1 = int(input("Введите значение n "))
    print(recursion_sum(val1))
