# Напишите рекурсивную функцию pow_n, на вход которой 
# подается два значения n и k (по умолчанию равно 8). 
# Функция должна возвращать значение следующего вида: n^k.

# Ваш код 


if __name__ == "__main__":
    n = int(input("Введите значение n "))
    print(pow_n(n))
