# Напишите рекурсивную функцию num_reverse, на вход которой 
# подается целочисленное значение. Функция должна возвращать 
# число, где цифры расположены в обратном порядке. 
# Например, 1456 -> 6541.

# Ваш код 


if __name__ == "__main__":
    number = int(input("Введите значение n "))
    print(num_reverse(number))
