# Напишите рекурсивную функцию recursion_gcd, на вход которой 
# подается два целочисленных значения. Функция должна возвращать 
# их наибольший общий делитель. 

# Ваш код 


if __name__ == "__main__":
    a = int(input("Введите первое число:"))
    b = int(input("Введите второе число:"))
    print(recursion_gcd(a, b))
