# Дан словарь my_dict = {1: 10, 'a': 5, 'b': '^_^'}. 
# Добавьте в него следующую связку «ключ:значение» - 100: '-_-' 
# и выведите полученный словарь в терминал.
def app(my_dict: dict) -> None:
    my_dict[100] = '-_-'
    print(my_dict)


if __name__ == "__main__":
    my_dict = {1: 10, "a": 5, "b": "^_^"}
    app(my_dict)
