# Напишите функцию closure_count_str, на вход которой подается строка.
# Функция должна возвращать другую функцию, принимающую символ 
# и возвращающую количество его повторений. 

# Ваш код 


if __name__ == "__main__":
    x = closure_count_str("qwerqqrqqqqtqqry")
    print(x("q"))
    print(x("r"))
