# Дан кортеж my_ tuple = (1, 2, 3, 4, 5, 6, 2, 1, 2, 'a', 'b', 2, 5). 
# На его основе сформируйте новый, состоящий из первого, среднего и 
# последнего элемента первой переменной. 
# Полученный результат выведите в терминал. 
def app(my_tuple: tuple) -> None:
    print(my_tuple[0], my_tuple[len(my_tuple)//2], my_tuple[-1])


if __name__ == "__main__":
    my_tuple = (1, 2, 3, 4, 5, 6, 1, 2, "a", "b", 2, 5)
    app(my_tuple)
