# Дана переменная z = 138 и х = 15. Используя побитовые операции и 
# не прибегая к буферной переменной, поменяйте значение этих 
# переменных местами и выведите полученный результат в терминал.
def app(z: int, x: int):
    ... # ваш код
    print(f'{z} {x}')


if __name__ == "__main__":
    z = 138
    x = 15
    app(z, x)
