# Дана переменная val1 = 157. Осуществите ее деление по модулю 
# на 3 и выведите полученный результат в терминал.
def app(val1: int):
    print(val1 % 3)


if __name__ == "__main__":
    val1 = 157

    app(val1)
