# Дана переменная val1 = 10. С клавиатуры вводится целочисленное значение и записывается в val2. 
# Посчитайте произведение и выведите полученный результат в терминал.
def app():
    val1 = 10
    val2 = int(input())
    print(val1 * val2)


if __name__ == "__main__":
    app()
