# На вход программы подается 2 значения: val1, val2. 
# Возведите val1 в степень val2 и выведите полученный результат в терминал.
def app():
    val1 = int(input())
    val2 = int(input())
    print(val1 ** val2)


if __name__ == "__main__":
    app()
